Experiment Setups - Citus/citus_results/workers_5/pgbench_t300.log
pgbench -h 127.0.0.1 -p 5432 -U postgres -d postgres -c 200 -j 8 -t 300 -M prepared -n -f ../workloads/read50_write50.sql --max-tries=5
pgbench (17.4, server 17.5 (Debian 17.5-1.pgdg120+1))
transaction type: ../workloads/read50_write50.sql
scaling factor: 1
query mode: prepared
number of clients: 200
number of threads: 8
maximum number of tries: 5
number of transactions per client: 300
number of transactions actually processed: 60000/60000
number of failed transactions: 0 (0.000%)
number of transactions retried: 0 (0.000%)
total number of retries: 0
latency average = 169.094 ms
initial connection time = 590.667 ms
tps = 1182.776620 (without initial connection time)